In [6]:
%reload_ext sql
%sql sqlite:///test_capital_project.db

'Connected: @test_capital_project.db'

**Basic SQL Reminder Notes**

SELECT *

FROM *

WHERE *

"%" is wildcard for strings

"XOR" for one or other, but not both

ORDER BY [column name] asc/desc (asc/desc can be used after individual columns

ROUND works as we understand
--------

IN for lists Example:
-----
SELECT name FROM bbc
  WHERE name IN ('Sri Lanka', 'Ceylon',
                 'Persia',    'Iran')


**Multiple, indepnedent clauses are possible. Note the parentheses**

SELECT * FROM nobel

  WHERE subject IN ('physics')
  
  AND yr IN (1980)
  
  OR
  
  (subject IN ('chemistry')
  AND yr IN (1984))

In [11]:
%%sql

DROP TABLE IF EXISTS balance_sheets;

CREATE TABLE business_units (
    unit_id INTEGER,
    unit_name TEXT,
    category TEXT
);

CREATE TABLE balance_sheets (
    entry_id INTERGER,
    unit_id INTEGER,
    report_date DATE
    assets FLOAT
    liabilities FLOAT
    equity FLOAT
);

 * sqlite:///test_capital_project.db
Done.
Done.
Done.

[]

In [8]:
%%sql
INSERT INTO balance_sheets (unit, assets, liabilities) VALUES
('Retail Banking', 1000000, 750000),
('Credit Cards', 2000000, 1800000);

 * sqlite:///test_capital_project.db
2 rows affected.

[]

In [9]:
%%sql
SELECT * FROM balance_sheets;

 * sqlite:///test_capital_project.db
Done.

[('Retail Banking', 1000000.0, 750000.0),
 ('Credit Cards', 2000000.0, 1800000.0)]

In [10]:
import pandas as pd

result = %sql SELECT * FROM balance_sheets
df = result.DataFrame()
df.head()

 * sqlite:///test_capital_project.db
Done.

             unit     assets  liabilities
0  Retail Banking  1000000.0     750000.0
1    Credit Cards  2000000.0    1800000.0

In [12]:
%%sql
SELECT * FROM business_units;

 * sqlite:///test_capital_project.db
Done.

[]